Autodesk.Revit.DB.BRepBuilderSurfaceGeometry.Create(Autodesk.Revit.DB.Surface,Autodesk.Revit.DB.BoundingBoxUV)
Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface.
Remarks:
Permitted Surface types are those for which Autodesk.Revit.DB.BRepBuilder.IsPermittedSurfaceType(Autodesk.Revit.DB.Surface) returns true.
surface:
The Revit surface defining the geometry.
This BRepBuilderSurfaceGeometry stores a copy of the input surface.
surfaceEnvelope:
Envelope of the surface in the uv parametric domain. Defines the domain of interest for the created surface.
This is typically used to identify the domain of the face that references the surface in question.
Expected to either be null or define a valid domain.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A surface of this type cannot be used as a part of the geometry generated by BRepBuilder.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016